<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [476]:
from sqlalchemy import create_engine
import pandas as pd
import psycopg2

In [477]:
# вставьте сюда параметры подключения из юнита 1. Работа с базой данных из Python 
DBNAME = '-----'
USER = 'skill------'
PASSWORD = 'cCk-----'
HOST = '84.201-----'
PORT = 5432
# Параметры для подключения к базе данных удалила после завершения работы,
# так как в модуле было указано, что параметры подключения в открытом доступе - дурной тон

In [478]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [479]:
# текст запроса
query_3_1 = f'''
    SELECT  COUNT(name) AS cnt_vacancies
    FROM public.vacancies'''

In [480]:
# используем метод read_sql_query, чтобы получить результаты запроса сразу в виде датафрейма
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2579156848.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   cnt_vacancies
0          49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [481]:
# текст запроса
query_3_2 = f'''
    SELECT  COUNT(name) AS cnt_employers
    FROM public.employers'''

In [482]:
# результат запроса
df = pd.read_sql_query(query_3_2, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\3062646138.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_2, connection)

   cnt_employers
0          23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [483]:
# текст запроса
query_3_3 = f'''
    SELECT  COUNT(name) AS cnt_areas
    FROM public.areas'''

In [484]:
# результат запроса
df = pd.read_sql_query(query_3_3, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\928149064.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_3, connection)

   cnt_areas
0       1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [485]:
# текст запроса
query_3_4 = f'''
    SELECT  COUNT(name) AS cnt_industries
    FROM public.industries'''

In [486]:
# результат запроса
df = pd.read_sql_query(query_3_4, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2101691108.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_4, connection)

   cnt_industries
0             294

***

ВЫВОД из юнита 3:
Предварительный анализ данных показал, что объём данных велик, таблицы заполнены данными в нужном объёме и готовы в более детальному анализу.

***

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [487]:
# текст запроса
query_4_1 = f'''
    SELECT
        a.name AS area,
        COUNT(v.name) AS cnt
    FROM public.vacancies v
        JOIN public.areas a ON a.id = v.area_id
    GROUP BY 1
    ORDER BY 2 DESC
    LIMIT 5'''

In [488]:
# результат запроса
df = pd.read_sql_query(query_4_1, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2457173557.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_1, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [489]:
# текст запроса
query_4_2 = f'''
    SELECT
        COUNT(name) AS cnt
    FROM public.vacancies
    WHERE salary_from IS NOT NULL or salary_to IS NOT NULL'''

In [490]:
# результат запроса
df = pd.read_sql_query(query_4_2, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\970655580.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_2, connection)

     cnt
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [491]:
# текст запроса
query_4_3 = f'''
    SELECT
        ROUND(AVG(salary_from)) AS avg_from,
        ROUND(AVG(salary_to)) AS avg_to
    FROM public.vacancies
'''

In [492]:
# результат запроса
df = pd.read_sql_query(query_4_3, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2500607024.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_3, connection)

   avg_from    avg_to
0   71065.0  110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [493]:
# текст запроса
query_4_4 = f'''
    SELECT       
        schedule,
        employment,
        COUNT(name) AS vacanci 
    FROM public.vacancies
    GROUP BY 1, 2
    ORDER BY 3 DESC'''

In [494]:
# результат запроса
df = pd.read_sql_query(query_4_4, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2022935265.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_4, connection)

            schedule           employment  vacanci
0        Полный день     Полная занятость    35367
1   Удаленная работа     Полная занятость     7802
2      Гибкий график     Полная занятость     1593
3   Удаленная работа  Частичная занятость     1312
4     Сменный график     Полная занятость      940
5        Полный день           Стажировка      569
6     Вахтовый метод     Полная занятость      367
7        Полный день  Частичная занятость      347
8      Гибкий график  Частичная занятость      312
9        Полный день     Проектная работа      141
10  Удаленная работа     Проектная работа      133
11     Гибкий график           Стажировка      116
12    Сменный график  Частичная занятость      101
13  Удаленная работа           Стажировка       64
14     Гибкий график     Проектная работа       18
15    Сменный график           Стажировка       12
16    Вахтовый метод     Проектная работа        2
17    Сменный график     Проектная работа        1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [495]:
# текст запроса
query_4_5 = f'''
    SELECT       
        experience,
        COUNT(name) AS cnt
    FROM public.vacancies
    GROUP BY 1
    ORDER BY 2'''

In [496]:
# результат запроса
df = pd.read_sql_query(query_4_5, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2316260449.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_4_5, connection)

           experience    cnt
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

ВЫВОД из ЮНИТА 4: 

Детальный анализ данных показал, что колличество вакансий больше у соискателей с маленьким стажем работы но не без него, и чаще всего люди запрашивают график работы на полный день  и полная занятость, так больше шансов найти желаемую работу.

Попрактиковались применять агрегатные функции такие как COUNT и AVG

***

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [497]:
# текст запроса
query_5_1 = f'''
    SELECT       
        e.name,
        COUNT(v.name) AS cnt
    FROM public.vacancies v
        JOIN public.employers e ON e.id = v.employer_id
    GROUP BY 1
    ORDER BY 2 DESC
    LIMIT 5'''

In [498]:
# результат запроса
df = pd.read_sql_query(query_5_1, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\3834399874.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_1, connection)

            name   cnt
0         Яндекс  1933
1     Ростелеком   491
2       Тинькофф   444
3           СБЕР   428
4  Газпром нефть   331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [499]:
# текст запроса
query_5_2 = f'''
    SELECT       
        a.name,
        COUNT(e.name) AS employ,
        COUNT(v.name) AS vacanci
    FROM public.areas a
        LEFT JOIN public.employers e ON a.id = e.area
        LEFT JOIN public.vacancies v ON a.id = v.area_id
    WHERE v.area_id IS NULL
    GROUP BY 1
    ORDER BY 3, 2 DESC
    LIMIT 5'''

In [500]:
# результат запроса
df = pd.read_sql_query(query_5_2, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2250345976.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_2, connection)

                 name  employ  vacanci
0              Россия     410        0
1           Казахстан     207        0
2  Московская область      75        0
3  Краснодарский край      19        0
4            Беларусь      18        0

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [501]:
# текст запроса
query_5_3 = f'''
    SELECT       
        e.name AS employers,
        COUNT(DISTINCT v.area_id) AS areas
    FROM
        public.employers e
        JOIN public.vacancies v  ON e.id = v.employer_id  
    GROUP BY 1
    ORDER BY 2 DESC
    LIMIT 5'''

In [502]:
# результат запроса
df = pd.read_sql_query(query_5_3, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\201667002.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_3, connection)

                employers  areas
0                  Яндекс    181
1              Ростелеком    152
2              Спецремонт    116
3  Поляков Денис Иванович     88
4               ООО ЕФИН      71

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [503]:
# текст запроса
query_5_4 = f'''
    SELECT 
        COUNT(e.name) AS employers
        
    FROM
        public.employers e
        LEFT JOIN public.employers_industries i ON e.id = i.employer_id
        
    WHERE i.industry_id IS NULL 
    '''

In [504]:
# результат запроса
df = pd.read_sql_query(query_5_4, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\3493105328.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_4, connection)

   employers
0       8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [505]:
# текст запроса
query_5_5 = f'''
    SELECT 
        e.name AS name_employer,
        COUNT(i.industry_id) AS indust
        
    FROM
        public.employers e
        JOIN public.EMPLOYERS_INDUSTRIES i ON e.id = i.employer_id
          
    GROUP BY 1  
    HAVING COUNT(i.industry_id) = 4   
    ORDER BY 1
    LIMIT 5'''

In [506]:
# результат запроса
df = pd.read_sql_query(query_5_5, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\388711819.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_5, connection)

  name_employer  indust
0  101 Интернет       4
1      21vek.by       4
2          2ГИС       4
3            2К       4
4   4 пикселя +       4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [507]:
# текст запроса
query_5_6 = f'''
    SELECT 
        COUNT(e.name) AS cnt_employer
        
    FROM
        public.employers e
        JOIN public.EMPLOYERS_INDUSTRIES ei ON e.id = ei.employer_id
        JOIN public.INDUSTRIES i ON ei.industry_id = i.id
    WHERE i.name = 'Разработка программного обеспечения'   '''

In [508]:
# результат запроса
df = pd.read_sql_query(query_5_6, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\821628714.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_6, connection)

   cnt_employer
0          3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [509]:
# текст запроса
query_5_7 = f'''
    SELECT
        a.name AS city_mill_yandex,
        count(v.area_id) AS cnt_vacan
        
    FROM
        employers e
     	JOIN vacancies v ON e.id = v.employer_id
        JOIN areas a ON a.id = v.area_id
     	      
    WHERE e.name = 'Яндекс'
        AND a.name IN ('Москва', 'Санкт-Петербург', 'Новосибирск',
        'Екатеринбург', 'Казань', 'Нижний Новгород', 'Челябинск',
        'Красноярск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск',
        'Краснодар', 'Воронеж',  'Пермь', 'Волгоград')
    
    GROUP BY 1 
    
    UNION ALL

    SELECT 
        'Total',
        count(*)
        
    FROM 
        vacancies v
 	    JOIN employers e on e.id = v.employer_id
 	    JOIN areas a on a.id = v.area_id
      
    WHERE
        e.name = 'Яндекс'
        AND a.name IN ('Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург',
                 	'Казань', 'Нижний Новгород', 'Челябинск', 'Красноярск',
                 	'Самара', 'Уфа', 'Ростов-на-Дону', 'Омск', 'Краснодар',
                    'Воронеж',  'Пермь', 'Волгоград') 
    ORDER BY 2'''

In [510]:
# результат запроса
df = pd.read_sql_query(query_5_7, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\1965596796.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_5_7, connection)

   city_mill_yandex  cnt_vacan
0              Омск         21
1         Челябинск         22
2        Красноярск         23
3         Волгоград         24
4             Пермь         25
5            Казань         25
6    Ростов-на-Дону         25
7               Уфа         26
8            Самара         26
9         Краснодар         30
10          Воронеж         32
11      Новосибирск         35
12  Нижний Новгород         36
13     Екатеринбург         39
14  Санкт-Петербург         42
15           Москва         54
16            Total        485

***

ВЫВОД из ЮНИТа 5:

Анализз работодателей показал, что выявились работодатели-лидеры по количеству вакансий в разных регионах и в каких регионах какие работодатели присутствуют в каком количестве

***

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [511]:
# текст запроса
query_6_1 = f'''
    SELECT   COUNT(name) AS cnt_vacan
        
    FROM  vacancies
     	      
    WHERE 
        name ILIKE'%data%' 
        OR name ILIKE'%данн%'
    '''

In [512]:
# результат запроса
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\366702258.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

   cnt_vacan
0       1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [513]:
# текст запроса
query_6_2 = f'''
    SELECT   COUNT(name) AS cnt_DataScience_Junior
        
    FROM  vacancies
     	      
    WHERE 
        (name ILIKE '%data scientist%'
        or name ILIKE  '%data science%'
        or name ILIKE  '%исследователь данных%'
        or (name LIKE  '%ML%' and name NOT ILIKE '%HTML%')
        or name ILIKE  '%machine learning%'
        or name ILIKE  '%машинн%обучен%')
        
        AND (name ILIKE '%junior%'
        OR experience ILIKE '%Нет опыта%'
        OR employment ILIKE '%Стажировка%')
'''

In [514]:
# результат запроса
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2267038862.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   cnt_datascience_junior
0                      51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [515]:
# текст запроса
query_6_3 = f'''
    SELECT   COUNT(name) AS cnt_DS_SQL_postgres
        
    FROM  vacancies
     	      
    WHERE 
        (name ILIKE '%data scientist%'
        or name ILIKE  '%data science%'
        or name ILIKE  '%исследователь данных%'
        or (name LIKE  '%ML%' and name NOT ILIKE '%HTML%')
        or name ILIKE  '%machine learning%'
        or name ILIKE  '%машинн%обучен%')
        
        AND (key_skills ILIKE '%SQL%'
        OR key_skills ILIKE '%postgres%')
'''

In [516]:
# результат запроса
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\3794299702.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   cnt_ds_sql_postgres
0                  201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [517]:
# текст запроса
query_6_4 = f'''
    SELECT   COUNT(name) AS cnt_DataScience_Python
        
    FROM  vacancies
     	      
    WHERE 
        (name ILIKE '%data scientist%'
        or name ILIKE  '%data science%'
        or name ILIKE  '%исследователь данных%'
        or (name LIKE  '%ML%' and name NOT ILIKE '%HTML%')
        or name ILIKE  '%machine learning%'
        or name ILIKE  '%машинн%обучен%')
        
        AND (key_skills ILIKE '%Python%')
'''

In [518]:
# результат запроса
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\4264665179.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   cnt_datascience_python
0                     351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [519]:
# текст запроса
query_6_5 = f'''
    SELECT  
        ROUND(AVG(length(key_skills)
        -length(replace(key_skills, CHR(9), ''))+1), 2) AS key_skills_in_vacanc
        
    FROM  vacancies
     	      
    WHERE 
        (name ILIKE '%data scientist%'
        or name ILIKE  '%data science%'
        or name ILIKE  '%исследователь данных%'
        or (name LIKE  '%ML%' and name NOT ILIKE '%HTML%')
        or name ILIKE  '%machine learning%'
        or name ILIKE  '%машинн%обучен%')
'''

In [520]:
# результат запроса
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\3654210517.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   key_skills_in_vacanc
0                  6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [521]:
# текст запроса
query_6_6 = f'''
    SELECT  
        DISTINCT experience,
        ROUND(AVG(coalesce((salary_from+salary_to)/2, salary_from, salary_to)), 0) AS mean_salary      
      
    FROM  vacancies
     	      
    WHERE 
        (name ILIKE '%data scientist%'
        or name ILIKE  '%data science%'
        or name ILIKE  '%исследователь данных%'
        or (name LIKE  '%ML%' and name NOT ILIKE '%HTML%')
        or name ILIKE  '%machine learning%'
        or name ILIKE  '%машинн%обучен%')
        AND (experience ILIKE '%от 3 до 6 лет%')
    
    GROUP BY 1
'''

In [522]:
# результат запроса
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\519194770.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

      experience  mean_salary
0  От 3 до 6 лет     243115.0

***

ВЫВОД из ЮНИТа 6:

Предметный анализ данных помог нам понять по каким критериям можно совершать поиск той или иной специальности, вакансиии степени профессианализма соискателя.

***

# Общий вывод по проекту
Рынок труда в различных городах практически одинаковый, в особенности это касается городов-миллионников.

По колличеству работодателей - лидером является Москва.

Самыераспространённые ваканций - это IT- сфера.

In [523]:
# подведем итог исследования, обобщите выводы
# здесь можно (это будет плюсом) провести дополнительные исследования данных,
# сделать прогнозы, продумать варианты продолжения исследования

Задание 6.7. Найти самые высокооплачиваемые вакансии IT-сферы по желаемой заработной плате соискателей.

In [536]:
query_6_7 = f'''
    SELECT  
        name AS vacancies_IT,
         ROUND(AVG(coalesce((salary_from+salary_to)/2, salary_from, salary_to)), 0) AS mean_salary     
      
    FROM  vacancies
     	      
    WHERE 
        name LIKE  '%IT%'
        
    GROUP BY 1
    ORDER BY 2 DESC nulls last
    LIMIT 5
    
'''

In [537]:
# результат запроса
df = pd.read_sql_query(query_6_7, connection)
df

C:\Users\Елена Прекрасная\AppData\Local\Temp\ipykernel_1996\2268705913.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_7, connection)

                                  vacancies_it  mean_salary
0                 Директор IT (HoReCa, Retail)     550000.0
1  Директор по информационным технологиям (IT)     320000.0
2                                  IT Директор     300000.0
3              IT специалист (PHP-разработчик)     300000.0
4               Руководитель IT инфраструктуры     250000.0